/* 测试计算表达式的溢出，以及浮点数的数学属性 */
#include<stdio.h>

int main( void )
{
	printf( "(500*400)*(300*200) output:%d\n", ( 500 * 400 ) * ( 300 * 200 ));
	printf( "((500*400)*300)*200 output:%d\n", ( ( 500 * 400 ) * 300 ) * 200 );
	printf( "((200*500)*300)*400 output:%d\n", ( ( 200 * 500 ) * 300 ) * 400 );
	printf( "400*(200*(300*500)) output:%d\n", 400 * ( 200 * ( 300 * 500 )));
	printf( "(3.14+1e20)-1e20 output:%f\n", ( 3.14 + 1e20 ) - 1e20 );
	printf( "3.14+(1e20-1e20) output:%f\n", 3.14 + ( 1e20  - 1e20 ));

	return 0;
}
